package client;

/**
 * 打出的卡牌类型枚举类
 *
 * @author ：reol
 * @date ：Created in 2020/7/27 11:17
 */
public enum CardType {
    /**
     * 单张
     */
    c1,
    /**
     * 对子
     */
    c2,
    /**
     * 三个不带
     */
    c3,
    /**
     * 炸弹
     */
    c4,
    /**
     * 三带一
     */
    c31,
    /**
     * 三带二
     */
    c32,
    /**
     * 连对
     */
    c112233,
    /**
     * 飞机
     */
    c111222,
    /**
     * 飞机带
     */
    c11122234,
    /**
     * 飞机
     */
    c1112223344,
    /**
     * 顺子
     */
    c12345,
    /**
     * 王炸
     */
    c00,
    /**
     * 不能出牌
     */
    c0
}
